//
//  ViewController.m
//  TagsList
//
//  Created by 聂小波 on 2023/5/17.
//

#import "ViewController.h"
#import "BTagsUITableViewCell.h"

@interface ViewController () <UITableViewDelegate, UITableViewDataSource>

@property (nonatomic, strong) UITableView *tableView;
@property (nonatomic, strong) NSArray * dataSource;

@end

@implementation ViewController

- (void)viewDidLoad {
    [super viewDidLoad];
    
    [self initWithUI];
}

- (void)initWithUI {
    self.title = @"列表";
    self.view.backgroundColor = [UIColor whiteColor];
    [self.view addSubview:self.tableView];
}

#pragma mark - UITableViewDataSource

- (NSInteger)numberOfSectionsInTableView:(UITableView *)tableView {
    return self.dataSource.count;
}

- (NSInteger)tableView:(UITableView *)tableView numberOfRowsInSection:(NSInteger)section {
    return 1;
}

- (UIView *)tableView:(UITableView *)tableView viewForHeaderInSection:(NSInteger)section {
    UILabel *titleLabel = [[UILabel alloc] initWithFrame:CGRectMake(0, 0, 400, 30)];
    titleLabel.text = [NSString stringWithFormat:@"Section %lld", (long long)section];
    titleLabel.backgroundColor = [UIColor lightGrayColor];
    return titleLabel;
}

- (UITableViewCell *)tableView:(UITableView *)tableView cellForRowAtIndexPath:(NSIndexPath *)indexPath {
    BTagsUITableViewCell *cell = [tableView dequeueReusableCellWithIdentifier:NSStringFromClass(BTagsUITableViewCell.class)];
    cell.datas = self.dataSource[indexPath.section];
    return  cell;
}

#pragma mark - Get

- (UITableView *)tableView {
    if (!_tableView) {
        _tableView = [[UITableView alloc] initWithFrame:CGRectMake(0, 0, UIScreen.mainScreen.bounds.size.width, UIScreen.mainScreen.bounds.size.height) style:UITableViewStylePlain];
        _tableView.backgroundColor = UIColor.whiteColor;
        _tableView.delegate = self;
        _tableView.dataSource = self;
        _tableView.estimatedRowHeight = 30.0f;
        _tableView.sectionHeaderHeight = 30.0f;
        if (@available(iOS 15.0, *)) {
            _tableView.sectionHeaderTopPadding = 0;
        } else {
            // Fallback on earlier versions
        }
        [_tableView registerClass:[BTagsUITableViewCell class] forCellReuseIdentifier:NSStringFromClass(BTagsUITableViewCell.class)];
    }
    return _tableView;
}

- (NSArray *)dataSource{
    if (_dataSource == nil) {
        _dataSource = @[@[@"北京北京北京",@"上海上海上海",@"广州",@"深圳深",@"杭州",@"成都",@"天津"],
                        @[@"重庆",@"武汉",@"贵阳贵阳贵阳贵阳",@"郑州",@"济南",@"西安",@"合肥",@"南京",@"南宁",@"太原",@"昆明",@"福州"],
                        @[@"宁波",@"青岛",@"众所周知，iOS设备已良好的用户体验赢得了广大的用户群。iOS系统在用户点击屏幕会立即做出响应。而且很大一部分的操作是来自于用户的滑动操作。所以滑动的顺滑是使用户沉浸在app中享受的必要条件。接下来我们就谈谈iOS 10 中增加了那些新特性。",@"珠海",@"厦门",@"上海",@"烟台"],
                        @[@"金堂",@"金牛",@"内江",@"高新阳贵阳贵",@"合肥",@"合肥",@"合肥"],
                        @[@"合肥",@"合肥",@"合肥阳贵阳贵阳贵阳贵",@"昆明阳贵阳贵",@"昆明",@"昆明",@"昆明",@"昆明",@"昆明",@"昆明",@"昆明",@"昆明",@"昆明"],
                        @[@"珠海",@"珠海",@"珠海",@"珠海",@"珠海",@"珠海",@"阳贵阳贵珠海"],
                        @[@"北京北京北京",@"上海上海上海",@"广州",@"深圳深",@"杭州",@"成都",@"天津"],
                        @[@"重庆",@"武汉",@"贵阳贵阳贵阳贵阳",@"郑州",@"济南",@"西安",@"合肥",@"南京",@"南宁",@"太原",@"昆明",@"福州"],
                        @[@"宁波",@"青岛",@"众所周知，iOS设备已良好的用户体验赢得了广大的用户群。iOS系统在用户点击屏幕会立即做出响应。而且很大一部分的操作是来自于用户的滑动操作。所以滑动的顺滑是使用户沉浸在app中享受的必要条件。接下来我们就谈谈iOS 10 中增加了那些新特性。",@"珠海",@"厦门",@"上海",@"烟台"],
                        @[@"金堂",@"金牛",@"内江",@"高新阳贵阳贵",@"合肥",@"合肥",@"合肥"],
                        @[@"合肥",@"合肥",@"合肥阳贵阳贵阳贵阳贵",@"昆明阳贵阳贵",@"昆明",@"昆明",@"昆明",@"昆明",@"昆明",@"昆明",@"昆明",@"昆明",@"昆明"],
                        @[@"珠海",@"珠海",@"珠海",@"珠海",@"珠海",@"珠海",@"阳贵阳贵珠海"],
                        @[@"绵阳",@"绵阳",@"绵阳阳贵阳贵",@"绵阳",@"绵阳",@"绵阳",@"绵阳"],
                        @[@"重庆",@"武汉",@"贵阳贵阳贵阳贵阳",@"郑州",@"济南",@"西安",@"合肥",@"南京",@"南宁",@"太原",@"昆明",@"福州"],
                        @[@"宁波",@"青岛",@"众所周知，iOS设备已良好的用户体验赢得了广大的用户群。iOS系统在用户点击屏幕会立即做出响应。而且很大一部分的操作是来自于用户的滑动操作。所以滑动的顺滑是使用户沉浸在app中享受的必要条件。接下来我们就谈谈iOS 10 中增加了那些新特性。",@"珠海",@"厦门",@"上海",@"烟台"],
                        @[@"金堂",@"金牛",@"内江",@"高新阳贵阳贵",@"合肥",@"合肥",@"合肥"],
                        @[@"合肥",@"合肥",@"合肥阳贵阳贵阳贵阳贵",@"昆明阳贵阳贵",@"昆明",@"昆明",@"昆明",@"昆明",@"昆明",@"昆明",@"昆明",@"昆明",@"昆明"],
                        @[@"珠海",@"珠海",@"珠海",@"珠海",@"珠海",@"珠海",@"阳贵阳贵珠海"],
                        @[@"北京北京北京",@"上海上海上海",@"广州",@"深圳深",@"杭州",@"成都",@"天津"],
                        @[@"重庆",@"武汉",@"贵阳贵阳贵阳贵阳",@"郑州",@"济南",@"西安",@"合肥",@"南京",@"南宁",@"太原",@"昆明",@"福州"],
                        @[@"宁波",@"青岛",@"众所周知，iOS设备已良好的用户体验赢得了广大的用户群。iOS系统在用户点击屏幕会立即做出响应。而且很大一部分的操作是来自于用户的滑动操作。所以滑动的顺滑是使用户沉浸在app中享受的必要条件。接下来我们就谈谈iOS 10 中增加了那些新特性。",@"珠海",@"厦门",@"上海",@"烟台"],
                        @[@"金堂",@"金牛",@"内江",@"高新阳贵阳贵",@"合肥",@"合肥",@"合肥"],
                        @[@"合肥",@"合肥",@"合肥阳贵阳贵阳贵阳贵",@"昆明阳贵阳贵",@"昆明",@"昆明",@"昆明",@"昆明",@"昆明",@"昆明",@"昆明",@"昆明",@"昆明"],
                        @[@"珠海",@"珠海",@"珠海",@"珠海",@"珠海",@"珠海",@"阳贵阳贵珠海"],
                        @[@"绵阳",@"绵阳",@"绵阳阳贵阳贵",@"绵阳",@"绵阳",@"绵阳",@"绵阳"],
                        @[@"重庆",@"武汉",@"贵阳贵阳贵阳贵阳",@"郑州",@"济南",@"西安",@"合肥",@"南京",@"南宁",@"太原",@"昆明",@"福州"],
                        @[@"宁波",@"青岛",@"众所周知，iOS设备已良好的用户体验赢得了广大的用户群。iOS系统在用户点击屏幕会立即做出响应。而且很大一部分的操作是来自于用户的滑动操作。所以滑动的顺滑是使用户沉浸在app中享受的必要条件。接下来我们就谈谈iOS 10 中增加了那些新特性。",@"珠海",@"厦门",@"上海",@"烟台"],
                        @[@"金堂",@"金牛",@"内江",@"高新阳贵阳贵",@"合肥",@"合肥",@"合肥"],
                        @[@"合肥",@"合肥",@"合肥阳贵阳贵阳贵阳贵",@"昆明阳贵阳贵",@"昆明",@"昆明",@"昆明",@"昆明",@"昆明",@"昆明",@"昆明",@"昆明",@"昆明"],
                        @[@"珠海",@"珠海",@"珠海",@"珠海",@"珠海",@"珠海",@"阳贵阳贵珠海"],
                        @[@"北京北京北京",@"上海上海上海",@"广州",@"深圳深",@"杭州",@"成都",@"天津"],
                        @[@"重庆",@"武汉",@"贵阳贵阳贵阳贵阳",@"郑州",@"济南",@"西安",@"合肥",@"南京",@"南宁",@"太原",@"昆明",@"福州"],
                        @[@"宁波",@"青岛",@"众所周知，iOS设备已良好的用户体验赢得了广大的用户群。iOS系统在用户点击屏幕会立即做出响应。而且很大一部分的操作是来自于用户的滑动操作。所以滑动的顺滑是使用户沉浸在app中享受的必要条件。接下来我们就谈谈iOS 10 中增加了那些新特性。",@"珠海",@"厦门",@"上海",@"烟台"],
                        @[@"金堂",@"金牛",@"内江",@"高新阳贵阳贵",@"合肥",@"合肥",@"合肥"],
                        @[@"合肥",@"合肥",@"合肥阳贵阳贵阳贵阳贵",@"昆明阳贵阳贵",@"昆明",@"昆明",@"昆明",@"昆明",@"昆明",@"昆明",@"昆明",@"昆明",@"昆明"],
                        @[@"珠海",@"珠海",@"珠海",@"珠海",@"珠海",@"珠海",@"阳贵阳贵珠海"],
                        @[@"绵阳",@"绵阳",@"绵阳阳贵阳贵",@"绵阳",@"绵阳",@"绵阳",@"绵阳"],
                        @[@"重庆",@"武汉",@"贵阳贵阳贵阳贵阳",@"郑州",@"济南",@"西安",@"合肥",@"南京",@"南宁",@"太原",@"昆明",@"福州"],
                        @[@"宁波",@"青岛",@"众所周知，iOS设备已良好的用户体验赢得了广大的用户群。iOS系统在用户点击屏幕会立即做出响应。而且很大一部分的操作是来自于用户的滑动操作。所以滑动的顺滑是使用户沉浸在app中享受的必要条件。接下来我们就谈谈iOS 10 中增加了那些新特性。",@"珠海",@"厦门",@"上海",@"烟台"],
                        @[@"金堂",@"金牛",@"内江",@"高新阳贵阳贵",@"合肥",@"合肥",@"合肥"],
                        @[@"合肥",@"合肥",@"合肥阳贵阳贵阳贵阳贵",@"昆明阳贵阳贵",@"昆明",@"昆明",@"昆明",@"昆明",@"昆明",@"昆明",@"昆明",@"昆明",@"昆明"],
                        @[@"珠海",@"珠海",@"珠海",@"珠海",@"珠海",@"珠海",@"阳贵阳贵珠海"],
                        @[@"北京北京北京",@"上海上海上海",@"广州",@"深圳深",@"杭州",@"成都",@"天津"],
                        @[@"重庆",@"武汉",@"贵阳贵阳贵阳贵阳",@"郑州",@"济南",@"西安",@"合肥",@"南京",@"南宁",@"太原",@"昆明",@"福州"],
                        @[@"宁波",@"青岛",@"众所周知，iOS设备已良好的用户体验赢得了广大的用户群。iOS系统在用户点击屏幕会立即做出响应。而且很大一部分的操作是来自于用户的滑动操作。所以滑动的顺滑是使用户沉浸在app中享受的必要条件。接下来我们就谈谈iOS 10 中增加了那些新特性。",@"珠海",@"厦门",@"上海",@"烟台"],
                        @[@"金堂",@"金牛",@"内江",@"高新阳贵阳贵",@"合肥",@"合肥",@"合肥"],
                        @[@"合肥",@"合肥",@"合肥阳贵阳贵阳贵阳贵",@"昆明阳贵阳贵",@"昆明",@"昆明",@"昆明",@"昆明",@"昆明",@"昆明",@"昆明",@"昆明",@"昆明"],
                        @[@"珠海",@"珠海",@"珠海",@"珠海",@"珠海",@"珠海",@"阳贵阳贵珠海"],
                        @[@"绵阳",@"绵阳",@"绵阳阳贵阳贵",@"绵阳",@"绵阳",@"绵阳",@"绵阳"]
                       ];
    }
    return _dataSource;
}


@end
